ExchangePlans/ОбменУправлениеХолдингомДокументооборот20.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменУправлениеХолдингомДокументооборот20</Name>
			<Comment>Синхронизация данных конфигураций "1С:Управление холдингом" и "1С:Документооборот"</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЗаявкиНаОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПроектыИПроектныеЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьВыгрузкуОрганизациями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Comment>Тип операции бюджетирования Управления холдингом</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>48</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменУправлениеХолдингомДокументооборот20/Forms/ФормаНастройкиУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтаФорма, "ОбменУправлениеХолдингомДокументооборот20");
	
	ВременнаяТаблица = ЗаявкиНаОперации.Выгрузить();
	ЗаявкиНаОперации.Очистить();
	
	ПоддерживаемыеТипы = ПланыОбмена.ОбменУправлениеХолдингомДокументооборот20.ПоддерживаемыеТипыОпераций();
	Для Каждого КлючИЗначение из ПоддерживаемыеТипы Цикл
		
		Строка = ЗаявкиНаОперации.Добавить();
		Строка.ТипОперации = КлючИЗначение.Ключ;
		Строка.ТипОперацииПредставление = КлючИЗначение.Значение;
		
		СтруктураПоиска = Новый Структура("ТипОперации", Строка.ТипОперации);
		НастроенныеСтроки = ВременнаяТаблица.НайтиСтроки(СтруктураПоиска);
		Если НастроенныеСтроки.Количество() <> 0 Тогда
			Строка.ВидДокумента = НастроенныеСтроки[0].ВидДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияДокументооборотКлиент.ПередЗакрытием(
		Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	// Удалим незаполненные строки.
	Н = 0;
	Пока Н < ЗаявкиНаОперации.Количество() Цикл
		Строка = ЗаявкиНаОперации.Получить(Н);
		Если ЗначениеЗаполнено(Строка.ВидДокумента) Тогда
			Н = Н + 1;
		Иначе
			ЗаявкиНаОперации.Удалить(Н);
		КонецЕсли;
	КонецЦикла;
	
	ОграничиватьВыгрузкуОрганизациями = Организации.Количество() <> 0;
	ВыгружатьДоговоры = Договоры.Количество() <> 0;
	ВыгружатьЗаявкиНаОперации = ЗаявкиНаОперации.Количество() <> 0;
	
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
